Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПриказОПриеме") Тогда
		ФизическоеЛицо = Основание.ФизическоеЛицо;
		Подразделение = Основание.Подразделение;
		Должность = Основание.Должность;
		ПриказОПриеме = Основание;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	
	Движения.Сотрудники.Записывать = Истина;
	Движения.ПлановыеОсновныеНачисления.Записывать = Истина;
	Движения.ПлановыеДополнительныеНачисления.Записывать = Истина;
	Движения.ПлановыеУдержания.Записывать = Истина;
	
	Движения.Записать();
	
	ЗаполнитьНЗ_Сотрудники();

    ЗаполнитьНаборыЗаписейДолгосрочныеНачисления();
	
КонецПроцедуры


Процедура ЗаполнитьНаборыЗаписейДолгосрочныеНачисления()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ПлановыеОсновныеСрезПоследних.ФизическоеЛицо,
	|	ПлановыеОсновныеСрезПоследних.ВидРасчета
	|ИЗ
	|	РегистрСведений.ПлановыеОсновныеНачисления.СрезПоследних(&ДатаУвольнения, ФизическоеЛицо = &ФизическоеЛицо) КАК ПлановыеОсновныеСрезПоследних
	|ГДЕ
	|	ПлановыеОсновныеСрезПоследних.Размер > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлановыеДополнительныеНачисленияСрезПоследних.ФизическоеЛицо,
	|	ПлановыеДополнительныеНачисленияСрезПоследних.ВидРасчета
	|ИЗ
	|	РегистрСведений.ПлановыеДополнительныеНачисления.СрезПоследних(&ДатаУвольнения, ФизическоеЛицо = &ФизическоеЛицо) КАК ПлановыеДополнительныеНачисленияСрезПоследних
	|ГДЕ
	|	ПлановыеДополнительныеНачисленияСрезПоследних.Размер > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлановыеУдержанияСрезПоследних.ФизическоеЛицо,
	|	ПлановыеУдержанияСрезПоследних.ВидРасчета
	|ИЗ
	|	РегистрСведений.ПлановыеУдержания.СрезПоследних(&ДатаУвольнения, ФизическоеЛицо = &ФизическоеЛицо) КАК ПлановыеУдержанияСрезПоследних
	|ГДЕ
	|	ПлановыеУдержанияСрезПоследних.Размер > 0");
	
	Запрос.УстановитьПараметр("ДатаУвольнения",ДатаСобытия-1);
	Запрос.УстановитьПараметр("ФизическоеЛицо",ФизическоеЛицо);
	
	МассивРЗ = Запрос.ВыполнитьПакет();

    ЗаполнитьНЗ_ПлановыеОсновныеНачисления(МассивРЗ[0]);
	ЗаполнитьНЗ_ПлановыеДополнительныеНачисления(МассивРЗ[1]);
	ЗаполнитьНЗ_ПлановыеУдержания(МассивРЗ[2]);
	
КонецПроцедуры

Процедура ЗаполнитьНЗ_Сотрудники()
	
	Движения.Сотрудники.Записывать = Истина;
	Движение = Движения.Сотрудники.Добавить();
	
	Движение.Период = ДатаСобытия;
	Движение.ФизическоеЛицо = ФизическоеЛицо;
	Движение.Подразделение = Подразделение;
	Движение.Должность = Должность;
	Движение.Состояние = Перечисления.СостоянияФизическогоЛица.Уволен;
	
КонецПроцедуры

Процедура ЗаполнитьНЗ_ПлановыеОсновныеНачисления(Результат)
	
	Движения.ПлановыеОсновныеНачисления.Записывать = Истина;
	
	Выборка = Результат.Выбрать();
	
	ПОка Выборка.Следующий() Цикл
		// регистр ПлановыеОсновныеНачисления 
		Движение = Движения.ПлановыеОсновныеНачисления.Добавить();
		Движение.Период = ДатаСобытия;
		Движение.ФизическоеЛицо = ФизическоеЛицо;
		Движение.ВидРасчета = Выборка.ВидРасчета;
		Движение.Размер = 0;
	КонецЦикла;
	
	
	
КонецПроцедуры

Процедура ЗаполнитьНЗ_ПлановыеДополнительныеНачисления(Результат)
	
	Движения.ПлановыеДополнительныеНачисления.Записывать = Истина;
	
	Выборка = Результат.Выбрать();
	
	ПОка Выборка.Следующий() Цикл

		Движение = Движения.ПлановыеДополнительныеНачисления.Добавить();
		Движение.Период = ДатаСобытия;
		Движение.ФизическоеЛицо = ФизическоеЛицо;
		Движение.ВидРасчета = Выборка.ВидРасчета;
		Движение.Размер = 0;
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ЗаполнитьНЗ_ПлановыеУдержания(Результат)
	
	Движения.ПлановыеУдержания.Записывать = Истина;
	
	Выборка = Результат.Выбрать();
	
	ПОка Выборка.Следующий() Цикл
		// регистр ПлановыеУдержания 
		Движение = Движения.ПлановыеУдержания.Добавить();
		Движение.Период = ДатаСобытия;
		Движение.ФизическоеЛицо = ФизическоеЛицо;
		Движение.ВидРасчета = Выборка.ВидРасчета;
		Движение.Размер = 0;
	КонецЦикла;
	
КонецПроцедуры




