
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ВзаиморасчетыСРаботниками.Записывать = Истина;
	
	Для Каждого ТекСтрокаСписокРаботников Из СписокРаботников Цикл
		Движение = Движения.ВзаиморасчетыСРаботниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Работник = ТекСтрокаСписокРаботников.ФизическоеЛицо;
		Движение.Сумма = ТекСтрокаСписокРаботников.Сумма;
	КонецЦикла;


КонецПроцедуры

Процедура ЗаполнитьЗадолженностиПоРаботникам() Экспорт

	Момент = ?(ЭтоНовый(),Неопределено,МоментВремени());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыСРаботникамиОстатки.Работник,
	|	ВзаиморасчетыСРаботникамиОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСРаботниками.Остатки(&Момент, ) КАК ВзаиморасчетыСРаботникамиОстатки
	|ГДЕ
	|	ВзаиморасчетыСРаботникамиОстатки.СуммаОстаток > 0";
	
	Запрос.УстановитьПараметр("Момент", Момент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СписокРаботников.Загрузить(РезультатЗапроса.Выгрузить());
	

КонецПроцедуры

