
Процедура ОбработкаПроведения(Отказ, Режим)

	ЗаполнитьНаборЗаписей_ДополнительныеНачисления();
	
	Движения.ДополнительныеНачисления.Записывать = Истина;
	Движения.Записать();
	
	РассчитатьРесурсы_ДополнительныеНачисления();

КонецПроцедуры

Процедура ЗаполнитьНаборЗаписей_ДополнительныеНачисления()
    
    Движение = Движения.ДополнительныеНачисления.Добавить();
	
	Движение.Сторно = Ложь;
    Движение.ВидРасчета = ПланыВидовРасчета.ДополнительныеНачисления.ПремияРуководителю;
    
    Движение.ПериодРегистрации = ПериодРегистрации;
    
    Движение.БазовыйПериодНачало = ДобавитьМесяц(ПериодРегистрации,-1);
    Движение.БазовыйПериодКонец = ПериодРегистрации -1;
    
    Движение.ФизическоеЛицо = ФизическоеЛицо;
    Движение.Подразделение = Подразделение;
    Движение.Должность = Должность;
    Движение.Результат = 0;
    Движение.Размер = РазмерПремии;
    
КонецПроцедуры

Процедура РассчитатьРесурсы_ДополнительныеНачисления()

	

КонецПроцедуры
