Процедура ЗаполнитьТабличнуюЧастьВедущиеВидыРасчета(ВидРасчета, ПВРОбъект) Экспорт

	Если ПВРОбъект.ВедущиеВидыРасчета.Найти(ВидРасчета, "ВидРасчета") = Неопределено Тогда

		НоваяСтрока = ПВРОбъект.ВедущиеВидыРасчета.Добавить();
		НоваяСтрока.ВидРасчета = ВидРасчета;
		
	Иначе 
		
		Возврат;

	КонецЕсли;

	Для Каждого ТекСтрокаБазовыеВидыРасчета Из ВидРасчета.БазовыеВидыРасчета Цикл

		ЗаполнитьТабличнуюЧастьВедущиеВидыРасчета(
		ТекСтрокаБазовыеВидыРасчета.ВидРасчета, ПВРОбъект);

	КонецЦикла;

	Если ТипЗнч(ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ОсновныеНачисления") Тогда

		Для Каждого ТекСтрокаВытесняющиеВидыРасчета Из ВидРасчета.ВытесняющиеВидыРасчета Цикл

			ЗаполнитьТабличнуюЧастьВедущиеВидыРасчета(
			ТекСтрокаВытесняющиеВидыРасчета.ВидРасчета, ПВРОбъект);

		КонецЦикла;
	КонецЕсли;

КонецПроцедуры