Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПриказОПриеме") Тогда
		ФизическоеЛицо = Основание.ФизическоеЛицо;
		Подразделение = Основание.Подразделение;
		Должность = Основание.Должность;
		ПриказОПриеме = Основание;
	КонецЕсли;
КонецПроцедуры

//-------------------------------------------------

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ЗаполнитьНЗ_Сотрудники();
	
КонецПроцедуры

Процедура ЗаполнитьНЗ_Сотрудники()
	
	Движения.Сотрудники.Записывать = Истина;
	
	Движение = Движения.Сотрудники.Добавить();
	
	Движение.Период = ДатаСобытия;
	Движение.ФизическоеЛицо = ФизическоеЛицо;
	Движение.Подразделение = Подразделение;
	Движение.Должность = Должность;
	Движение.Состояние = Перечисления.СостоянияФизическогоЛица.Уволен;
	
КонецПроцедуры





