
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриказОПриеме") Тогда

		ДокументОснование = ДанныеЗаполнения;
		ГрафикРаботы = ДанныеЗаполнения.ГрафикРаботы;
		Должность = ДанныеЗаполнения.Должность;
		Подразделение = ДанныеЗаполнения.Подразделение;
		ФизическоеЛицо = ДанныеЗаполнения.ФизическоеЛицо;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КадровоеИзменение") Тогда

		ДокументОснование = ДанныеЗаполнения;
		ГрафикРаботы = ДанныеЗаполнения.ГрафикРаботы;
		Должность = ДанныеЗаполнения.Должность;
		Подразделение = ДанныеЗаполнения.Подразделение;
		ФизическоеЛицо = ДанныеЗаполнения.ФизическоеЛицо;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Сотрудники.Записывать = Истина;
	Движения.Записать();
	
	
	ЗаполнитьНаборЗаписей_Сотрудники();
	
	
КонецПроцедуры

Процедура ЗаполнитьНаборЗаписей_Сотрудники()
	
	Движения.Сотрудники.Записывать = Истина;
	
	Движение = Движения.Сотрудники.Добавить();
	
	Движение.Период = ДатаСобытия;
	Движение.ФизическоеЛицо = ФизическоеЛицо;
	Движение.Подразделение = Подразделение;
	Движение.Должность = Должность;
	Движение.Состояние = Перечисления.СостоянияФизическогоЛица.Перемещение;
	Движение.ГрафикРаботы = ГрафикРаботы;
	
КонецПроцедуры


