
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Сотрудники.Записывать = Истина;
	Движения.Записать();
	
	
	ЗаполнитьНаборЗаписей_Сотрудники();
	
	
КонецПроцедуры

Процедура ЗаполнитьНаборЗаписей_Сотрудники()
	
	Движения.Сотрудники.Записывать = Истина;
	
	Движение = Движения.Сотрудники.Добавить();
	
	Движение.Период = ДатаСобытия;
	Движение.ФизическоеЛицо = ФизическоеЛицо;
	Движение.Подразделение = Подразделение;
	Движение.Должность = Должность;
	Движение.Состояние = Перечисления.СостоянияФизическогоЛица.Работает;
	Движение.ГрафикРаботы = ГрафикРаботы;
	
КонецПроцедуры

